[["B.Tech 1st Semester WEST CAMPUS", "Published By: Dr. ATHAR HUSSAIN, ASSOCIATE PROFESSOR, CIVIL ENGINEERING"], ["GOOGLE CLASSROOM CODES OF WEST CAMPUS COURSES(UPDATED)", "Published By: Dr. ATHAR HUSSAIN, ASSOCIATE PROFESSOR, CIVIL ENGINEERING"], ["M. Tech. Thesis Dissertation of III Sem", "Published By: Dr. UMANG SONI, ASSISTANT PROFESSOR, MECHANICAL ENGINEERING"], ["Notification for Inauguration of Lecture Theater Complex.", "Published By: Mr. RAVINDER KUMAR, DEAN STUDENT WELFARE OFFICE"], ["M. Tech Dissertation Phase I Presentation and Viva", "Published By: Dr AKHILESH DUBEY, ASSISTANT PROFESSOR, BIO TECHNOLOGY"], ["LIST of BTech/BBA Students whose result has been shared with NSUT \\\"Innovation Business model\\\"", "Published By: Dr. ANAND GUPTA, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"], ["BBA 1st Sem Link also provided - Google Form Links for Uploading Required Documents by newly admitted 1st Sem Students", "Published By:  KHUSHIL KUMAR SAINI, CENTRAL COMPUTER CENTER"], ["Codes for Google classroom EO009 Entrepreneurship", "Published By: Dr DURU ARUN KUMAR, MANAGEMENT"], ["B Tech 1st Semester Course Registration Not Submitted till 10 PM on 06/01/2021", "Published By:  KHUSHIL KUMAR SAINI, COORDINATOR, UNIVERSITY MANAGEMENT CENTRE, CENTRAL COMPUTER CENTER"], ["Interview schedule for UTA for M.Tech.(MCDA) student of IT Department", "Published By: Dr DEVENDER KUMAR YADAV, ASSISTANT PROFESSOR, INFORMATION TECHNOLOGY"], ["Class code BBAC404  Sem-IV 2020-21", "Published By: Prof. ANJANA SARKAR, HOD, CHEMISTRY"], ["Google classroom codes for EO004 HRM", "Published By: Dr DURU ARUN KUMAR, ASSOCIATE PROFESSOR, MANAGEMENT"], ["Google Classroom Codes for ME/MPAE Backlog Courses", "Published By: Dr. ANDRIYA NARASIMHULU, ASSISTANT PROFESSOR, MECHANICAL ENGINEERING"], ["LIST OF PENDING DUES OF B.E. 2016-2020 BATCH", "Published By: Mrs MAHESHWARI CHANDRA, SECTION OFFICER, ACADEMIC SECTION"], ["Time Table for EO030 Polymer Science and Technology (Sem 8)\\r\\n& Google Class Codes Batch-1 & 2", "Published By: Prof. ANJANA SARKAR, HOD, CHEMISTRY"], ["REGISTRATION FOR SIMILAR COURSES WITH DIFFERENT COURSE CODES", "Published By: Dr. SUJATA SENGAR, DEAN ACADEMICS, ACADEMIC SECTION"], ["8Th Semester Time table for EO 033 Material Physics, Deptt Of Physics", "Published By: Prof. O. P. THAKUR, PROFESSOR, PHYSICS"], ["Class Codes of Technical Communication (6th Semester) and Basics of Social Sciences (8th Semester) and Social Work(8th Semester)", "Published By: DR TANUSHREE CHOUDHARY, HUMANITIES AND SOCIAL SCIENCES"], ["Notice for the F.E(Foundation Elective Even Sem) courses re-registration of NSIT students.", "Published By: Mr LAMBODAR MISHRA, DATA PROCESSOR, ACADEMIC SECTION"], ["GOOD INTERNET CONNECTION  TO ATTEND ONLINE CLASSES", "Published By: Dr. SUJATA SENGAR, DEAN ACADEMICS, ACADEMIC SECTION"], ["EO018 Google Class Codes (Batch 1 to 4)", "Published By: Dr YATENDER KUMAR, ASSISTANT PROFESSOR, BIO TECHNOLOGY"], ["CREDIT DEFICIT / EXCESS OF FINAL YEAR  B.E. STUDENTS", "Published By: Dr. SUJATA SENGAR, DEAN ACADEMICS, ACADEMIC SECTION"], ["Regarding      uploading/reloading of sixth semester CSE registration forms", "Published By:  RITU SIBAL, PROFESSOR, COMPUTER ENGINEERING"], ["REGISTRATION FOR COURSES IN CLASHING TIME SLOTS", "Published By: Dr. SUJATA SENGAR, ACADEMIC SECTION"], ["NSS Enrollment form for all the first year and second year Under Graduate courses of NSUT. The last date to fill registration form is 13,01,2021", "Published By: Dr PRAVEEN SAROHA, OFFICER INCHARGE, PHYSICAL EDUCATION"], ["ECE 4th Semester Time Table with Revised Course Codes", "Published By: Dr. TARUN KUMAR RAWAT, ASSISTANT PROFESSOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["CLASS CODE FOR ECC19 SECTION 3", "Published By: Mr RAJESH KUMAR, GUEST FACULTY, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["Google Class codes of ECE VI Semester, section 1 and 2", "Published By: Prof JYOTSNA SINGH, INSTRUCTOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["CLASS CODES FOR ECC21 SECTION I & II", "Published By:  PARUL GARG, INSTRUCTOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["classcodes for ICE Even SEMESTER 2020", "Published By: Prof. ASHA RANI, PROFESSOR, INSTRUMENTATION AND CONTROL ENGINEERING"], ["Google Class Code for CED39 - Distributed Computing B.E(COE) 8th Semester", "Published By:  RAJEEV KUMAR, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"], ["Class codes of various courses in BSE Deptt.", "Published By: Dr. SHILPA SHARMA, ASSISTANT PROFESSOR, BIO TECHNOLOGY"], ["Google Class Codes for CECSC10 Theory of Automata and Formal Languages B Tect CoE 4h Sem Sec I and II", "Published By:  BIJENDRA KUMAR, INSTRUCTOR, COMPUTER SCIENCE AND ENGINEERING"], ["Google classroom codes for FEMG005 Project Management - 8th semester and MBAC401 Corporate Ethics and Governance - MBA 4th Semester", "Published By: Dr DURU ARUN KUMAR, INSTRUCTOR, MANAGEMENT"], ["ECC19 Microwave Engineering (Sections 1 and 2) Google Classroom codes.", "Published By: Dr. SHAILESH MISHRA, ASSISTANT PROFESSOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["ECC20: VLSI (Sections 3) Google Classroom code", "Published By: Dr SHWETA GAUTAM, ASSISTANT PROFESSOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["ECD 26: Satellite Communication (Sections 1,2 and 3) Google Classroom codes", "Published By: Dr. SHAILESH MISHRA, ASSISTANT PROFESSOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["Google Classroom codes for CEC-14, ECE VI SEM (Batch-1 and Batch-2)", "Published By: Dr. ANAND GUPTA, INSTRUCTOR, COMPUTER ENGINEERING"], ["ITECC13: Analog and Digital Communication (Sections 1 and 2)  Google Classroom codes", "Published By: Dr. TARUN KUMAR RAWAT, INSTRUCTOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["Google Classroom codes for CED03 (Software Testing)", "Published By:  SANGEETA SABHARWAL, PROFESSOR, COMPUTER ENGINEERING"], ["ASSESMENT/ACTIVITY CALENDAR FOR I/IV SEMESTER NSUT B.TECH/BBA/M.TECH & VI/VIII SEMESTER NSIT (Dec 2020 to May 2021)", "Published By: Dr. SUJATA SENGAR, DEAN ACADEMICS, ACADEMIC SECTION"], ["Revised 6th Semester COE Master Time Table", "Published By: Dr PREETI KAUR, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"], ["Re Registration Form Uploading Links For Semester 6 & 8 Students", "Published By: SH ASHWANI TEWATHIA, DATA ENTRY OPERATOR, CENTRAL COMPUTER CENTER"], ["ECE department 7th sem end term project evaluation", "Published By:  BHAWNA AGGARWAL, ASSISTANT PROFESSOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["Google Class Codes For 4th,6th,8th Semesters  (MATHEMATICS)", "Published By: DR MAMTA MISHRA, ASSOCIATE PROFESSOR, MATHEMATICS"], ["SYLLABUS Environmental Sciences and Green Chemistry: FCCH008", "Published By: Prof. ANJANA SARKAR, INSTRUCTOR, CHEMISTRY"]]